{
	"changeLang": "Español",
	"sponsor1": "Andalusian School of Public Health",
	"sponsor2": "University of Granada",
	"privacy": "Privacy policy",
	"privacyLink": "/texts/en/privacy",
	"appLoading": "The app is loading. Please, wait a moment.",
	"next": "Next",
	"back": "Back",
	"cancel": "Cancel",
	"loading": "Loading",
	"error": "Error",
	"acceptError": "Accept",
	"download": "Download",
	"actions": "Actions",
	"weightsVar": "Weight variable",
	"home": "Home",
	"projectsTab": "Projects",
	"loadTab": "Data loading",
	"dataTab": "Data",
	"biasTab": "Bias",
	"weightTab": "Weighting",
	"evalTab": "Weight evaluation",
	"estimationTab": "Estimation",
	"defaultProject": "Working survey",
	"defaultProjectDesc": "The working survey should contain the data the user wishes to estimate, as well as the available weights. BETTERSURVEYS accepts data in Excel format.",
	"loadTitle": "Load data files",
	"loadSubtitle": "Load data files containing your own data and the reference survey file in order to validate and compare them.",
	"loadStep1": "Load file - My survey",
	"loadStep2": "Load file - Auxiliary data",
	"loadOption1": "Load my survey for reweighting",
	"loadOption1Subtitle": "Load the survey data file in order to analyze it.",
	"loadOption2": "Load auxiliary data",
	"loadOption2Subtitle": "Load auxiliary data in order to compare them with your own data.",
	"fileSelect": "Pick the <b>choosen file</b> with extension *.xlsx in order to load it.",
	"fileButton": "Load file",
	"fileButtonSubtitle": "It must be a *.xlsx file",
	"loadFile1Title": "My data",
	"loadFile1Subtitle": "Descripción de qué fichero correspondería a los \"datos propios\".",
	"loadFile1Action": "Load my own data file",
	"loadFile1ActionHelp": "Texto de ayuda que acompaña a \"Cargar fichero de datos propios\"",
	"loadFile2Title": "Auxiliary data",
	"loadFile2Subtitle": "Descripción de qué fichero correspondería a los \"datos auxiliares\".",
	"loadFile2Action": "Load the auxiliary data file",
	"loadFile2ActionHelp": "Remember that the names of the variables to be compared must match those in your survey data.",
	"loadFile2Subaction": "Select the weight variable in the auxiliary data",
	"loadFile2SubactionSubtitle": "Select the variable containing the weights if there is one",
	"loadFile2SubactionHelp": "From the list of quantitative variables, indicate whether there is a variable in the database that contains the sample weights.",
	"loadFileError": "Error loading the file. Please, check the format and try again.",
	"loadFileConfirm": "Validate data",
	"loadFileLoading": "Please wait a moment while both files are analyzed",
	"loadFileFinalError": "Error when analyzing the files",
	"noWeights": "No weight variable",
	"noFileTitle": "Insert totals",
	"noFileSubtitle": "I do not have auxiliary data but I do have some totals I would like to assess my survey with.",
	"noFileSubSubtitle": "Otro texto para confirmar \"Insertar totales\"",
	"noFileConfirm": "Insert totals",
	"loadedFilesTitle": "Everything is ready! Both data files have been analyzed and compared",
	"loadedFilesSubtitle": "<b>$nVars apparently harmonized variables</b> have been detected. In order to harmonize more variables, you may download any data file by clicking the \"Actions\" button, make the pertinent changes and re-upload them from this same screen.",
	"loadNewData": "Load new data",
	"downloadData": "Download data",
	"download1Title": "Download my data",
	"download1Subtitle": "You can download your survey data from this screen in order to adapt the data to the platform's requirements for reweighting the sample or to export the weight variables calculated.",
	"download2Title": "Download auxiliary data",
	"download2Subtitle": "You can download the auxiliary data from this screen to adapt it to the platform's requirements for reweighting the sample.",
	"downloadFilename": "File name",
	"downloadFormat": "Which format do you want?",
	"downloadFormatPlaceholder": "Choose a file extension",
	"downloadConfirm": "Save file",
	"downloadLoading": "Please wait a moment while we prepare the file",
	"downloadError": "Error downloading the file",
	"export1": "Export my data",
	"export2": "Export auxiliary data",
	"variables": "Variables",
	"typeReason": "The variables cannot be harmonized because they use different data types.",
	"categoriesReason": "The variables cannot be harmonized because there are different categories.",
	"weightReason": "This variable cannot be harmonized because it is a weight variable.",
	"missingReason": "The variables cannot be harmonized because only one of them has missing data.",
	"mean": "Mean",
	"deviation": "Standard deviation",
	"max": "Maximum",
	"min": "Minimum",
	"CV": "CV",
	"median": "Median",
	"Q1": "Q1",
	"Q3": "Q3",
	"IQR": "IQR",
	"skew": "Skewness",
	"kurt": "Kurtosis",
	"missing": "Missing data",
	"insertTotals": "Insert totals",
	"editTotals": "Edit totals",
	"editTotalsSubtitle": "Enter the values of the population totals",
	"deleteTotals": "Clear data",
	"setTotals": "Update",
	"missingError": "A variable containing missing data cannot be calibrated",
	"totals1": "My data totals",
	"totals2": "Auxiliary data totals",
	"total": "Total amount",
	"inferTotals": "Infer from the auxiliary data",
	"weightTitle": "Weighting parameters",
	"emptyTitle": "No data",
	"emptyDescription": "In order to calculate weights <b>harmonized variables or variables with totals</b> must be selected from the <b>Data</b> tab.",
	"method": "Method",
	"methodTitle": "What is a method?",
	"methodDescription": "To see the details of the weighting methods programmed into the application, please refer to the <a href=\"https://easp.es/info/bettersurveys/documentacion-descargas/\" target=\"_blank\" rel=\"noopener\">documentation section</a> of the project website.",
	"methodPlaceholder": "Select a method in order to get details",
	"methodExplain": "What is it?",
	"methodExplainTitle": "Method details",
	"methodExplainDescription": "This section includes additional information about the chosen method.",
	"calibration": "Calibration",
	"calibrationTitle": "Calibration method",
	"calibrationDescription": "La técnica de calibración <a href=\"https://doi.org/10.2307/2290268\" target=\"_blank\" rel=\"noopener\">(Deville y Särndal, 1992)</a> es un método de reponderación en el que los nuevos pesos deben de cumplir que la estimación del total poblacional que se realice con ellos para las variables auxiliares coincida con los totales reales de dichas variables. Al mismo tiempo, estos pesos tienen que ser lo más similares posible a los pesos de diseño originales de la encuesta que se quiere calibrar, lo cual se hace minimizando una función distancia entre los pesos originales y los nuevos. En <a href=\"https://doi.org/10.2307/2290268\" target=\"_blank\" rel=\"noopener\">Deville y Särndal (1992)</a> se enuncian distintas alternativas para la función distancia. La que se emplea aquí es la distancia Raking <a href=\"https://doi.org/10.2307/2290793\" target=\"_blank\" rel=\"noopener\">(Deville, Särndal y Sautory, 1993)</a>, la cual asegura que los totales estimados para los cruces de variables también coincidan con los totales esperados para dichos cruces en la población. En la práctica es el método de reponderación más usado por los organismos oficiales de encuestas.",
	"calibrationMissing": "In order to apply calibration, either select an initial weight variable or enter the population size.",
	"calibrationError": "Error applying calibration with the given totals. Please check that the totals specified among different variables are coherent.",
	"psa": "PSA with logistic regression",
	"psaTitle": "Propensity Score Adjustment with logistic regression",
	"psaDescription": "El Propensity Score Adjustment (<a href=\"https://www.scb.se/contentassets/ca21efb41fee47d293bbee5bf7be7fb3/propensity-score-adjustment-as-a-weighting-scheme-for-volunteer-panel-web-surveys.pdf\" target=\"_blank\" rel=\"noopener\">Lee, 2006</a>; <a href=\"https://doi.org/10.1177/0049124108329643\" target=\"_blank\" rel=\"noopener\">Lee y Valliant, 2009</a>) es un método por el cual se estiman las probabilidades de participar (originalmente desconocidas) para los individuos de la encuesta no probabilística. Para ello, se combina ésta con una encuesta probabilística y se ajusta un modelo predictivo para predecir la probabilidad de que un individuo de la muestra combinada pertenezca a la muestra no probabilística. Este modelo predictivo puede ser una regresión logística o cualquier otro algoritmo predictivo; seleccionando esta opción, se emplea la regresión logística para la predicción de probabilidades. Dicha regresión requiere que no haya datos faltantes, por lo que se realiza imputación en cada una de las variables independientes. En las variables numéricas, se imputa a través de la mediana y se crea una variable nueva que indique si el dato es faltante o no (la cual se incluye en la regresión posterior). En las variables no numéricas, se crea una categoría nueva correspondiente a datos faltantes. En el caso de estas últimas, también se agrupan todas aquellas clases que no superen una frecuencia relativa del 5% en una única clase denominada “Infrecuentes”. Al ajustar los modelos, y siguiendo la pseudo log-verosimilitud empírica descrita en <a href=\"https://doi.org/10.1080/01621459.2019.1677241\" target=\"_blank\" rel=\"noopener\">Chen, Li y Wu (2020)</a>, se tienen en cuenta los pesos de diseño de la encuesta probabilística para que las probabilidades estén escaladas correctamente al conjunto de la población, en lugar de únicamente a la suma de individuos de ambas muestras (lo que daría lugar a probabilidades más grandes de la cuenta). Finalmente, las probabilidades se transforman en pesos a aplicar en la encuesta no probabilística. Se han estudiado diversas transformaciones en la literatura; en esta herramienta se emplea la fórmula: Pesos = (1 – Probabilidad)/Probabilidad, desarrollada en <a href=\"https://doi.org/10.1214/16-sts597\" target=\"_blank\" rel=\"noopener\">Schonlau y Couper (2017)</a>.",
	"psaError": "Unknown error applying Propensity Score Adjustment",
	"psaBoost": "PSA with Gradient Boosting",
	"psaBoostTitle": "Propensity Score Adjustment with Gradient Boosting",
	"psaBoostDescription": "El Propensity Score Adjustment (<a href=\"https://www.scb.se/contentassets/ca21efb41fee47d293bbee5bf7be7fb3/propensity-score-adjustment-as-a-weighting-scheme-for-volunteer-panel-web-surveys.pdf\" target=\"_blank\" rel=\"noopener\">Lee, 2006</a>; <a href=\"https://doi.org/10.1177/0049124108329643\" target=\"_blank\" rel=\"noopener\">Lee y Valliant, 2009</a>) es un método por el cual se estiman las probabilidades de participar (originalmente desconocidas) para los individuos de la encuesta no probabilística. Para ello, se combina ésta con una encuesta probabilística y se ajusta un modelo predictivo para predecir la probabilidad de que un individuo de la muestra combinada pertenezca a la muestra no probabilística. Este modelo predictivo puede ser una regresión logística o cualquier otro algoritmo predictivo; seleccionando esta opción, se emplea el algoritmo de aprendizaje automático Histogram-Based Gradient Boosting Classification Tree <a href=\"https://doi.org/10.1007/978-3-030-37334-4_4\" target=\"_blank\" rel=\"noopener\">(Guryanov, 2019)</a> para la predicción de probabilidades. Al ajustar los modelos, y siguiendo las instrucciones de ponderación del algoritmo de Gradient Boosting descritas en <a href=\"https://doi.org/10.1016/j.matcom.2024.06.012\" target=\"_blank\" rel=\"noopener\">Ferri-García et al. (2024)</a>, se tienen en cuenta los pesos de diseño de la encuesta probabilística para que las probabilidades estén escaladas correctamente al conjunto de la población, en lugar de únicamente a la suma de individuos de ambas muestras (lo que daría lugar a probabilidades más grandes de la cuenta). Finalmente, las probabilidades se transforman en pesos a aplicar en la encuesta no probabilística. Se han estudiado diversas transformaciones en la literatura; en esta herramienta se emplea la fórmula: Pesos = (1 – Probabilidad)/Probabilidad, desarrollada en <a href=\"https://doi.org/10.1214/16-sts597\" target=\"_blank\" rel=\"noopener\">Schonlau y Couper (2017)</a>. De esta manera, se tiene en cuenta que los individuos de la encuesta no probabilística no forman parte de la población objetivo de la encuesta probabilística.",
	"psaBoostError": "Unknown error applying Propensity Score Adjustment with Gradient Boosting",
	"kw": "KW",
	"kwTitle": "Kernel Weighting with logistic regression",
	"kwDescription": "El método de Kernel Weighting (<a href=\"https://doi.org/10.1111/rssa.12564\" target=\"_blank\" rel=\"noopener\">Wang et al., 2020</a>; <a href=\"https://doi.org/10.1093/jssam/smaa028\" target=\"_blank\" rel=\"noopener\">Kern et al., 2021</a>) utiliza las probabilidades de participar en la muestra no probabilística que proporciona el método PSA. Concretamente, calcula las diferencias en dicha probabilidad entre cada unidad de la muestra probabilística y cada unidad de la muestra no probabilística. Estas diferencias se suavizan utilizando una función Kernel, y los pesos finales para un individuo de la muestra no probabilística se obtienen sumando los pesos de diseño de cada unidad de la muestra probabilística multiplicados por la diferencia suavizada de esa unidad con la unidad de la muestra no probabilística cuyo peso vamos a obtener. En esta opción, las probabilidades de participación obtenidas con el PSA se estiman utilizando un modelo de regresión logística; puede consultar más información sobre este método seleccionando la opción \"PSA con regresión logística\"",
	"kwError": "Applying Kernel weighting uses a huge amount of memory which may exceed browser limits. Please try using <a href=\"https://pypi.org/project/inps/\" target=\"_blank\" rel=\"noopener\">INPS</a> directly.",
	"kwBoost": "KW with Gradient Boosting",
	"kwBoostTitle": "Kernel Weighting with Gradient Boosting",
	"kwBoostDescription": "El método de Kernel Weighting (<a href=\"https://doi.org/10.1111/rssa.12564\" target=\"_blank\" rel=\"noopener\">Wang et al., 2020</a>; <a href=\"https://doi.org/10.1093/jssam/smaa028\" target=\"_blank\" rel=\"noopener\">Kern et al., 2021</a>) utiliza las probabilidades de participar en la muestra no probabilística que proporciona el método PSA. Concretamente, calcula las diferencias en dicha probabilidad entre cada unidad de la muestra probabilística y cada unidad de la muestra no probabilística. Estas diferencias se suavizan utilizando una función Kernel, y los pesos finales para un individuo de la muestra no probabilística se obtienen sumando los pesos de diseño de cada unidad de la muestra probabilística multiplicados por la diferencia suavizada de esa unidad con la unidad de la muestra no probabilística cuyo peso vamos a obtener. En esta opción, las probabilidades de participación obtenidas con el PSA se estiman utilizando el algoritmo de aprendizaje automático Histogram-Based Gradient Boosting Classification Tree <a href=\"https://doi.org/10.1007/978-3-030-37334-4_4\" target=\"_blank\" rel=\"noopener\">(Guryanov, 2019)</a>; puede consultar más información sobre este método seleccionando la opción \"PSA con Gradient Boosting\"",
	"kwBoostError": "Applying Kernel weighting uses a huge amount of memory which may exceed browser limits. Please try using <a href=\"https://pypi.org/project/inps/\" target=\"_blank\" rel=\"noopener\">INPS</a> directly.",
	"origWeights": "Original weight variable",
	"origWeightsTitle": "Original weight variable",
	"origWeightsDescription": "Descripción de \"Variable de pesos originales\".",
	"uniformWeights": "Uniform weight",
	"popSize": "Target population",
	"popSizeTitle": "Target population size",
	"popSizeDescription": "Total number of individuals in the population from which the sample was obtained. If auxiliary data are available, the inferred value based on the selected weight variable is suggested by default. This is the same population total from which the variable totals are inferred, so it should be used when working with inferred totals. For other methods, this value can be left blank, and relative weights will be calculated.",
	"popSizePlaceholder": "E.g. 11456",
	"activeVars": "Variables used with this method",
	"changeVars": "Change selected variables",
	"newVar": "Adjusted weight variable name",
	"newVarPlaceholder": "E.g. psa_weight1",
	"weightButton": "Calculate",
	"weightLoading": "This process may take a few minutes. Please wait while the new weight variable is calculated.",
	"estimatedWeightTitle": "Everything is ready! The weighting process has been successfully applied.",
	"estimatedWeightSubtitle": "We have added the weight variable \"$name\" to \"My data\". You can check out the evaluation below or download the database from the button above.",
	"estimationTitle": "Calculate estimations",
	"targetVar": "Target variable",
	"selectVar": "Choose a variable",
	"estimationMethod": "Estimation method",
	"estimationMethodDescription": "Texto de ayuda para \"Método de estimación\". Para poder optimizar las estimaciones hay que haber seleccionado variables armonizadas. Cuando se activa, si los pesos son uniformes se aplica Matching (se predice la variable objetivo en la muestra de referencia con un modelo ajustado según la información de la muestra no probabilística y se estima a partir de ella, como si fuesen los valores reales) y en caso contrario se aplica Training (idéntico al Matching pero el modelo en esta ocasión es ponderado según los pesos que se indiquen). Si los pesos son uniformes, también están disponibles métodos avanzados que estiman intervalos de confianza más precisos a cambio de ser mucho más lentos.",
	"noMatching": "No optimization",
	"linearMatching": "Matching with linear regression",
	"boostedMatching": "Matching with Gradient Boosting",
	"advancedPsa": "Advanced PSA with linear regression",
	"advancedPsaBoost": "Advanced PSA with Gradient Boosting",
	"advancedKw": "Advanced KW with linear regression",
	"advancedKwBoost": "Advanced KW with Gradient Boosting",
	"advancedLinearMatching": "Advanced Matching with linear regression",
	"advancedBoostedMatching": "Advanced Matching with Gradient Boosting",
	"advancedLinearTraining": "Advanced Training with linear regression",
	"advancedBoostedTraining": "Advanced Training with Gradient Boosting",
	"compare": "Compare",
	"compareVar": "Weight variable to compare",
	"compareMethod": "Estimation method to compare",
	"estimate": "Estimate",
	"emptyEstimation": "Choose a variable from the <b>\"Target variable\"</b> drop-down in order to estimate",
	"estimationLoading": "This process may take a few minutes. Please wait while the estimations are calculated.",
	"estimationError": "Error loading the estimations",
	"lowDataError": "Some categories lack sufficient data",
	"estimationHeader": "Table of estimates",
	"estimationChartHeader": "Estimates chart",
	"comparedHeader": "Table of comparative estimates",
	"comparedChartHeader": "Comparative estimates chart",
	"numericEstimation": "Estimation",
	"percentageEstimation": "Estimation %",
	"numericInterval": "95% CI",
	"pertentageInterval": "95% CI",
	"mainEstimation": "Current estimator",
	"altEstimation": "Estimator to compare",
	"biasTitle": "Sample bias",
	"emptyBias": "Choose a variable from the <b>\"Variable to compare\"</b> drop-down in order to analyze the bias",
	"invalidBias": "Some auxiliary data with harmonized variables are required in order to analyze the bias",
	"biasVar": "Variable to compare",
	"getBias": "Show bias",
	"biasLoading": "Please wait a moment while we analyze the bias...",
	"biasError": "Error calculating the bias",
	"biasTable": "Frequency chart",
	"biasDifference": "Statistics of absolute and relative frequency differences",
	"biasAbsolute": "Absolute differences",
	"biasRelative": "Relative differences",
	"biasChart": "Grouped bar charts",
	"evalTitle": "Weight evaluation",
	"emptyEval": "Choose a variable from the <b>\"Weight variable\"</b> drop-down in order to evaluate the weights",
	"getEval": "Evaluate weights",
	"evalLoading": "Please wait a moment while the weights are evaluated...",
	"evalError": "Error evaluating the weights",
	"evalProperties": "Weight properties",
	"evalBoxplot": "Weight boxplot",
	"evalHistogram": "Weight histogram"
}
